CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash/flashapi_512bit_programming/flashapi_cpu1_512bitprogramming.c
    if(oReturnCheck != Fapi_Status_Success)
    {
        //
        // Check Flash API documentation for possible errors
        //
        Example_Error(oReturnCheck);
    }

    //
    // Initialize the Flash banks and FMC for erase and program operations.
    // Fapi_setActiveFlashBank() function sets the Flash banks and FMC for
    // further Flash operations to be performed on the banks.
    //
    oReturnCheck = Fapi_setActiveFlashBank(Fapi_FlashBank0);

    if(oReturnCheck != Fapi_Status_Success)
    {
        //
        // Check Flash API documentation for possible errors
        //
        Example_Error(oReturnCheck);
    }

    //
    // Erase all bank before programming
    //
    Example_EraseBanks();

    //
    // Fill a buffer with data to program into the flash.
    //
    for(i=0; i < WORDS_IN_FLASH_BUFFER; i++)
    {
        Buffer[i] = i;
    }

    //
    // Program all Bank using AutoECC option
    //
    // Note that executing entire bank needs a special flash API library -
	// for this 
	Example_ProgramAllBankUsing512bitAutoECC();
	//

    //
    // Erase all bank before programming
    // Erase bank before programming
    //
    Example_EraseBanks();

    //
    // Program all bank using DataOnly and ECCOnly options
    //
    Example_ProgramAllBankUsing512bitDataOnlyECCOnly();

    //
    // Erase all bank before programming
    //
    Example_EraseBanks();

    //
    // Program all bank using DataAndECC option
    //
    Example_ProgramAllBankUsing512bitDataAndECC();

    //
    // Erase all bank before programming
    //
    Example_EraseBanks();

}

//*****************************************************************************
//  Example_ProgramAllBankUsing512bitAutoECC
//
//  Example function to Program data in Flash using "AutoEccGeneration" option.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************

#ifdef __cplusplus
#pragma CODE_SECTION(".TI.ramfunc");
#else
#pragma CODE_SECTION(Example_ProgramAllBankUsing512bitAutoECC, ".TI.ramfunc");
#endif
void Example_ProgramAllBankUsing512bitAutoECC(void)
{
    uint32 u32Index = 0;
    uint32 sector = 0;
    uint16 i = 0;
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType  oFlashStatusWord;

    //
    // A data buffer of max 32 16-bit words can be supplied to the program
    // function.
    // Each word is programmed until the whole buffer is programmed or a
    // problem is found. However to program a buffer that has more than 32
    // words, program function can be called in a loop to program 32 words for
    // each loop iteration until the whole buffer is programmed.
    //
    // Remember that the main array flash programming must be aligned to
    // 512-bit address boundaries and each 512 bit word may only be programmed
    // once per write/erase cycle.  Meaning the length of the data buffer
    // (3rd parameter for Example_ProgramAllBankUsing512bitAutoECC() function) passed
    // to the program function can only be 32.
    //
    // Program data in Flash using "AutoEccGeneration" option.
    // When AutoEccGeneration option is used, Flash API calculates ECC for the
    // given 64-bit data and programs it along with the 64-bit main array data.
    // Note that any unprovided data with in a 64-bit data slice
    // will be assumed as 1s for calculating ECC and will be programmed.
    //
    // Note that data buffer (Buffer) is aligned on 512-bit boundary for verify
    // reasons.
    //
    // Monitor ECC address for Bank while programming with AutoEcc mode.
    //
    // In this example, all Flash Bank are programmed using auto-generated
    // ECC.
    //

    // Program Bank 0
    for(sector = Bzero_Sector12_start; sector < FlashBank0EndAddress;
            sector += Sector2KB_u16length)
    {
        for(i=0, u32Index = sector;
           (u32Index < (sector + WORDS_IN_FLASH_BUFFER));
            i+= 32, u32Index+= 32)
        {
            ClearFSMStatus();
            // Enable program/erase protection for select sectors where this example is
            // located
            // CMDWEPROTA is applicable for sectors 0-31
            // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
            // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
            // sectors 40-47, etc
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0x00000FFF);
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0x00000000);

            oReturnCheck = Fapi_issueAutoEcc512ProgrammingCommand((uint32 *)u32Index,
                                                        Buffer+i, 32);
            //
            // Wait until the Flash program operation is over
            //
            while(Fapi_checkFsmForReady() == Fapi_Status_FsmBusy);

            if(oReturnCheck != Fapi_Status_Success)
            {
                //
                // Check Flash API documentation for possible errors
                //
                Example_Error(oReturnCheck);
            }

            //
            // Read FMSTAT register contents to know the status of FSM after
            // program command to see if there are any program operation
            // related errors
            //
            oFlashStatus = Fapi_getFsmStatus();
            if(oFlashStatus != 3)
            {
                //
                //Check FMSTAT and debug accordingly
                //
                FMSTAT_Fail();
            }

            //
            // Verify the programmed values.  Check for any ECC errors.
            //

            oReturnCheck = Fapi_doVerify((uint32 *)u32Index,
                                          16, (uint32 *)(uint32)(Buffer + i),
                                          &oFlashStatusWord);

            if(oReturnCheck != Fapi_Status_Success)
            {
                //
                // Check Flash API documentation for possible errors
                //
                Example_Error(oReturnCheck);
            }
        }
    }


    // Program Bank 1-4

    for(sector = FlashBank1StartAddress; sector < FlashBank4EndAddress;
        sector += Sector2KB_u16length)
    {
        for(i=0, u32Index = sector;
           (u32Index < (sector + WORDS_IN_FLASH_BUFFER));
            i+= 32, u32Index+= 32)
        {
            ClearFSMStatus();

            // Enable program/erase protection for select sectors where this example is 
            // located
            // CMDWEPROTA is applicable for sectors 0-31
            // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
            // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
            // sectors 40-47, etc
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0x00000000);
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0x00000000);

            oReturnCheck = Fapi_issueAutoEcc512ProgrammingCommand((uint32 *)u32Index,
                                                        Buffer+i, 32);

            //
            // Wait until the Flash program operation is over
            //
            while(Fapi_checkFsmForReady() == Fapi_Status_FsmBusy);

