CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash/flashapi_512bit_programming/flashapi_cpu1_512bitprogramming.c
            if(oReturnCheck != Fapi_Status_Success)
            {
                //
                // Check Flash API documentation for possible errors
                //
                Example_Error(oReturnCheck);
            }

            //
            // Read FMSTAT register contents to know the status of FSM after
            // program command to see if there are any program operation
            // related errors
            //
            oFlashStatus = Fapi_getFsmStatus();
            if(oFlashStatus != 3)
            {
                //
                //Check FMSTAT and debug accordingly
                //
                FMSTAT_Fail();

            }


            //
            // Verify the programmed values.  Check for any ECC errors.
            //

            oReturnCheck = Fapi_doVerify((uint32 *)u32Index,
                                         16, (uint32 *)(uint32)(Buffer + i),
                                         &oFlashStatusWord);

            if(oReturnCheck != Fapi_Status_Success)
            {
                //
                // Check Flash API documentation for possible errors
                //
                Example_Error(oReturnCheck);
            }
        }
    }

}

//*****************************************************************************
//  Example_ProgramAllBankUsing512bitDataOnlyECCOnly
//
//  Example function to Program data in Flash using "DataOnly" option and ECC
//  using "EccOnly" option.
//  Flash API functions used in this function are executed from RAM in this
//  example.
//*****************************************************************************
#ifdef __cplusplus
#pragma CODE_SECTION(".TI.ramfunc");
#else
#pragma CODE_SECTION(Example_ProgramAllBankUsing512bitDataOnlyECCOnly, ".TI.ramfunc");
#endif
void Example_ProgramAllBankUsing512bitDataOnlyECCOnly(void)
{
    uint32 u32Index = 0;
    uint32 sector = 0;
    uint16 i = 0, j= 0, ECC_LB = 0, ECC_HB = 0, ECC_array[4] = {0};
    uint64 *LData, *HData;
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType  oFlashStatusWord;

    //
    // Program data using 512-bit "DataOnly" option and 64-bit ECC using "EccOnly" option.
    //
    // When DataOnly option is used, Flash API will program only the data
    // portion in Flash at the address specified.
    //
    // When EccOnly option is used, Flash API will program only the ECC portion
    // in Flash ECC memory space (Flash main array address should be provided
    // for this function and not the corresponding ECC address).
    // Fapi_calculateEcc is used to calculate the corresponding ECC of the data.
    //
    // Note that data buffer (Buffer) is aligned on 512-bit boundary for verify
    // reasons.
    //
    // In this example, Bank 0-4 are programmed
    // along with the specified ECC.
    //

    //Program Bank 0
   for(sector = Bzero_Sector12_start; sector < FlashBank0EndAddress;
       sector += Sector2KB_u16length)
    {
        for(i=0, u32Index = sector;
           (u32Index < (sector + WORDS_IN_FLASH_BUFFER));
           i+= 32, u32Index+= 32)
        {
            ClearFSMStatus();

            // Enable program/erase protection for select sectors where this example is
            // located
            // CMDWEPROTA is applicable for sectors 0-31
            // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
            // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
            // sectors 40-47, etc
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0x00000FFF);
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0x00000000);

            for(j=0;j<4;j++)
            {
                //
                // Point LData to the lower 64 bit data
                // and   HData to the higher 64 bit data
                //
                LData = (uint64 *)(Buffer32 + i/4 + j*4);
                HData = (uint64 *)(Buffer32 + i/4 + j*4 + 2);

                //
                // Calculate ECC for lower 64 bit and higher 64 bit data
                //
                ECC_LB = Fapi_calculateEcc((u32Index + j*8),*LData);
                ECC_HB = Fapi_calculateEcc((u32Index+ j*8 + 4) ,*HData);
                ECC_array[j] = ((ECC_HB<<8) | ECC_LB);
            }

            oReturnCheck = Fapi_issueDataOnly512ProgrammingCommand((uint32 *)u32Index,Buffer+i,
                                                        32);

            //
            // Wait until the Flash program operation is over
            //
            while(Fapi_checkFsmForReady() == Fapi_Status_FsmBusy);

            if(oReturnCheck != Fapi_Status_Success)
            {
                //
                // Check Flash API documentation for possible errors
                //
                Example_Error(oReturnCheck);
            }

            //
            // Read FMSTAT register contents to know the status of FSM after
            // program command to see if there are any program operation related
            // errors
            //
            oFlashStatus = Fapi_getFsmStatus();
            if(oFlashStatus != 3)
            {
                //Check FMSTAT and debug accordingly
                FMSTAT_Fail();
            }
            // Enable program/erase protection for select sectors where this example is
            // located
            // CMDWEPROTA is applicable for sectors 0-31
            // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
            // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
            // sectors 40-47, etc
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0x00000FFF);
            Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0x00000000);

            oReturnCheck = Fapi_issueEccOnly64ProgrammingCommand((uint32 *)u32Index,
                                                       &ECC_array[0], 8);

            //
            // Wait until the Flash program operation is over
            //
            while(Fapi_checkFsmForReady() == Fapi_Status_FsmBusy);

