CraftifAI/Firmgen/ti_c2000_sdk/driverlib/f28p65x/examples/c28x_dual/flash/flashapi_512bit_programming/flashapi_cpu1_512bitprogramming.c
     if(oReturnCheck != Fapi_Status_Success)
     {
         // Check Flash API documentation for possible errors
         Example_Error(oReturnCheck);
     }

     // Read FMSTAT register contents to know the status of FSM after
     // erase command to see if there are any erase operation related errors
     oFlashStatus = Fapi_getFsmStatus();
     if(oFlashStatus != 3)
     {
         // Check Flash API documentation for FMSTAT and debug accordingly
         // Fapi_getFsmStatus() function gives the FMSTAT register contents.
         // Check to see if any of the EV bit, ESUSP bit, CSTAT bit or
         // VOLTSTAT bit is set (Refer to API documentation for more details).
         FMSTAT_Fail();
      }

     // Do blank check
     // Blank check is performed on all the sectors that are not protected
     // during Bank erase
     // Verify that Bank 0 is erased.
     // The Erase command itself does a verify as it goes.
     // Hence erase verify by CPU reads (Fapi_doBlankCheck()) is optional.
     u32CurrentAddress = Bzero_Sector12_start;
     oReturnCheck = Fapi_doBlankCheck((uint32 *)u32CurrentAddress,
                 (116*Sector2KB_u32length),
                 &oFlashStatusWord);

    if(oReturnCheck != Fapi_Status_Success)
    {
         // Check Flash API documentation for error info
         Example_Error(oReturnCheck);
    }


    // Erase Bank 1 and Bank 4
    for(u32CurrentAddress = FlashBank1StartAddress; u32CurrentAddress < FlashBank4EndAddress; u32CurrentAddress +=FlashBankOffset)
    {

        ClearFSMStatus();

        // Enable program/erase protection for select sectors where this example is
        // located
        // CMDWEPROTA is applicable for sectors 0-31
        // Bits 0-11 of CMDWEPROTB is applicable for sectors 32-127, each bit represents
        // a group of 8 sectors, e.g bit 0 represents sectors 32-39, bit 1 represents
        // sectors 40-47, etc
        Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTA, 0x00000000);
        Fapi_setupBankSectorEnable(FLASH_WRAPPER_PROGRAM_BASE+FLASH_O_CMDWEPROTB, 0x00000000);

        //Issue bank erase command
        oReturnCheck = Fapi_issueBankEraseCommand((uint32 *)u32CurrentAddress);

        // Wait until FSM is done with erase sector operation
        while (Fapi_checkFsmForReady() != Fapi_Status_FsmReady){}

        if(oReturnCheck != Fapi_Status_Success)
        {
            // Check Flash API documentation for possible errors
            Example_Error(oReturnCheck);
        }

        // Read FMSTAT register contents to know the status of FSM after
        // erase command to see if there are any erase operation related errors
        oFlashStatus = Fapi_getFsmStatus();
        if(oFlashStatus != 3)
        {
            // Check Flash API documentation for FMSTAT and debug accordingly
            // Fapi_getFsmStatus() function gives the FMSTAT register contents.
            // Check to see if any of the EV bit, ESUSP bit, CSTAT bit or
            // VOLTSTAT bit is set (Refer to API documentation for more details).
            FMSTAT_Fail();
         }

        oReturnCheck = Fapi_doBlankCheck((uint32 *)u32CurrentAddress,
                    (128*Sector2KB_u32length),
                    &oFlashStatusWord);

       if(oReturnCheck != Fapi_Status_Success)
       {
            // Check Flash API documentation for error info
            Example_Error(oReturnCheck);
       }
    }

}

//******************************************************************************
// For this example, just stop here if an API error is found
//******************************************************************************
void Example_Error(Fapi_StatusType status)
{
    //
    //  Error code will be in the status parameter
    //
    __asm("    ESTOP0");
}

//******************************************************************************
//  For this example, once we are done just stop here
//******************************************************************************
void Example_Done(void)
{
    __asm("    ESTOP0");
}

//******************************************************************************
// For this example, just stop here if FMSTAT fail occurs
//******************************************************************************
void FMSTAT_Fail(void)
{
    __asm("    ESTOP0");
}

//
// End of File
//
